In [11]:
import pandas as pd
df=pd.read_csv("Titanic_original.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Unnamed: 12
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,NaN
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1,NaN
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,NaN
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1,NaN
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0,NaN

In [14]:
df=df.dropna(how="all",axis=1)
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [15]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [18]:
target=df.Survived
inputs=df.drop('Survived',axis=1)
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [19]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [20]:
inputs=pd.concat([inputs,dummies],axis=1)

In [35]:
inputs=inputs.drop("Sex",axis=1)

In [22]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [26]:
import math
inputs.Age=inputs.Age.fillna(math.floor(inputs.Age.mean()))

In [36]:
inputs.head(6)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1
5       3  29.0   8.4583       0     1

In [38]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(inputs,target,test_size=0.2)

In [39]:
len(X_train)

712

In [40]:
len(X_test)

179

In [41]:
len(inputs)

891

In [42]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [43]:
model.fit(X_train,Y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [44]:
model.score(X_test,Y_test)

0.7988826815642458

In [45]:
X_test[:10]

     Pclass   Age      Fare  female  male
515       1  47.0   34.0208       0     1
247       2  24.0   14.5000       1     0
737       1  35.0  512.3292       0     1
425       3  29.0    7.2500       0     1
75        3  25.0    7.6500       0     1
759       1  33.0   86.5000       1     0
760       3  29.0   14.5000       0     1
349       3  42.0    8.6625       0     1
572       1  36.0   26.3875       0     1
866       2  27.0   13.8583       1     0

In [46]:
Y_test[:10]

515    0
247    1
737    1
425    0
75     0
759    1
760    0
349    0
572    1
866    1
Name: Survived, dtype: int64

In [47]:
model.predict(X_test[:10])

array([0, 1, 1, 0, 0, 1, 0, 0, 0, 1], dtype=int64)

In [48]:
model.predict_proba(X_test[:10])

array([[9.15627071e-01, 8.43729291e-02],
       [5.00697486e-02, 9.49930251e-01],
       [3.76268501e-49, 1.00000000e+00],
       [9.88434108e-01, 1.15658920e-02],
       [9.87897627e-01, 1.21023727e-02],
       [1.55323055e-03, 9.98446769e-01],
       [9.88756760e-01, 1.12432396e-02],
       [9.89475514e-01, 1.05244858e-02],
       [9.21344011e-01, 7.86559893e-02],
       [5.19533299e-02, 9.48046670e-01]])